import { Accordion } from '../../accordion';

import st from './faq.module.css';

export const Faq = () => (
  <section className={st.layout}>
    <Accordion
      title="Найчастіші запитання"
      multiple
      items={[
        {
          question: 'Що таке черкаські зашквари?',
          answer: (
            <>
              Це дії та рішення, а також бездіяльність представників міської влади Черкас, які
              зашкодили громаді та/або викликали осуд та гостру негативну реакцію суспільства.
              <br />
              <br />
              Зокрема: тих, що призвели до втрат бюджетних коштів, землі або комунального майна,
              руйнування історичної спадщини міста, сприяли створенню корупційних ризиків, спонукали
              черкасців до масових протестних дій, подання колективних звернень та електронних
              петицій, що зібрали необхідну для розгляду кількість голосів.
            </>
          ),
        },
        {
          question: 'Якою може бути участь в зашкварі?',
          answer: (
            <>
              <ul>
                <li>ініціювання зашкварного по змісту рішення міської ради;</li>
                <li>голосування за зашкварне по змісту рішення міської ради;</li>
                <li>публічний виступ на підтримку зашкварного рішення;</li>
                <li>утримання від голосування за важливі для громади рішення міської ради;</li>
                <li>
                  фігурування у кримінальних провадженнях або судових справах, пов&apos;язаних з
                  черкаськими зашкварами;
                </li>
                <li>
                  участь афілійованих з посадовцем бізнесів у публічних закупівлях, пов&apos;язаних
                  з черкаськими зашкварами;
                </li>
                <li>наявність посадовця в базі корупціонерів;</li>
                <li>посадовець є бенефіціаром зашкварного рішення;</li>
                <li>
                  посадовець є об&apos;єктом перевірки НАЗК щодо відповідності способу життя
                  задекларованим доходам і майну;
                </li>
                <li>посадовець є фігурантом антикорупційного розслідування у ЗМІ.</li>
              </ul>
            </>
          ),
        },
        {
          question: 'З яких джерел ми беремо інформацію?',
          answer: (
            <>
              Щоб виявити черкаський зашквар і участь у ньому черкаських депутатів, ми
              використовуємо виключно відкриті джерела, а саме:
              <ul>
                <li>
                  Систему поіменного електронного голосування &quot;ГОЛОС&quot; Черкаської міської
                  ради (
                  <a href="https://chmr.golos.net.ua/?" target="_blank" rel="noopener noreferrer">
                    посилання
                  </a>
                  );
                </li>
                <li>
                  Сервіс подання електронних петицій Черкаської міської ради (
                  <a
                    href="https://petitions.chmr.gov.ua/"
                    target="_blank"
                    rel="noopener noreferrer"
                  >
                    посилання
                  </a>
                  );
                </li>
                <li>
                  Єдиний державний реєстр судових рішень (
                  <a href="https://reyestr.court.gov.ua/" target="_blank" rel="noopener noreferrer">
                    посилання
                  </a>
                  );
                </li>
                <li>
                  Сервіс YouControl (
                  <a href="https://youcontrol.com.ua/" target="_blank" rel="noopener noreferrer">
                    посилання
                  </a>
                  );
                </li>
                <li>
                  Єдиний державний реєстр осіб, які вчинили корупційні або пов&#39;язані з корупцією
                  правопорушення (
                  <a
                    href="https://corruptinfo.nazk.gov.ua/"
                    target="_blank"
                    rel="noopener noreferrer"
                  >
                    посилання
                  </a>
                  );
                </li>
                <li>
                  Реєстр порушників НАЗК (
                  <a
                    href="https://corruptinfo.nazk.gov.ua/"
                    target="_blank"
                    rel="noopener noreferrer"
                  >
                    https://corruptinfo.nazk.gov.ua/
                  </a>
                  );
                </li>
                <li>
                  Матеріали аналітичних та розслідувальних українських медіа (&laquo;18000: новини
                  Черкас&raquo;, &laquo;Сила правди&raquo;, &laquo;NGL.media&raquo;,
                  &laquo;Слідство.Інфо&raquo; тощо)
                </li>
              </ul>
            </>
          ),
        },
        {
          question: 'Як додати черкаський зашквар?',
          answer: (
            <>
              Команда проєкту самостійно визначає перелік черкаських зашкварів, які бере в
              опрацювання.
              <br />
              <br />
              Водночас будь-який житель громади може запропонувати проєкту зашквар, який відповідає
              зазначеним вище критеріям.
              <br />
              <br />
              Кнопка &quot;Запропонувати черкаський зашквар&quot; (пересилає на електронну пошту
              проєкту)
            </>
          ),
        },
        {
          question: 'Як додати фігуранта зашкварів?',
          answer: (
            <>
              На першому етапі ми зосередилися на міському голові та депутатах міської ради. На
              другому &mdash; розширемо категорію фігурантів на чиновників. Надсилайте нам зашквари
              &mdash; а ми будемо підтягувати тих, хто в них фігурує. Однак все відбуватиметься
              поступово, оскільки проєкт є волонтерським та наповнюється у вільний від основної
              зайнятості час.
            </>
          ),
        },
        {
          question: 'Що робити, якщо помітили помилку або неточність в наших даних?',
          answer: <>Пишіть нам на... (електронна пошта проєкту)</>,
        },
        {
          question: 'Хочете долучитися до команди волонтерів?',
          answer: <>Напишіть про себе і свою мотивацію нам на... (електронна пошта проєкту)</>,
        },
      ]}
    />
  </section>
);
